Tekla.Structures.ModelInternal.dotReferenceModelObject_t
Struct for the ReferenceModelObject

Tekla.Structures.ModelInternal.dotReferenceModelObject_t.ModelObject
The object we are extending (Inherited from)

Tekla.Structures.ModelInternal.dotReferenceModelObject_t.ReferenceModel
The reference model which the object is belonging to

Tekla.Structures.ModelInternal.dotReferenceModelObject_t.ReferenceHierarchyFather
The reference model which the object is belonging to